app/controllers/home_controller.rb

  def index
    @number_of_recipes = Recipe.count
    @latest_recipe = Recipe.last
---
SELECT count(*) AS count_all FROM "recipes"
SELECT * FROM "recipes" ORDER BY recipes.id DESC LIMIT 1